name: "face_extractor"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
{
  name: "images"
  data_type: TYPE_FP32
  dims: [ 1,3,-1,-1 ]
}
]
output [
{
  name: "output0"
  data_type: TYPE_FP32
  dims: [-1, -1, -1]
}
]

model_warmup {
   name: "face_extractor"
   batch_size: 1
   inputs: {
       key: "images"
       value: {
           data_type: TYPE_FP32
           dims: 1
           dims: 3
           dims: 384
           dims: 480
           zero_data: true
       }
   }
}

optimization {
  execution_accelerators {
    gpu_execution_accelerator : [ {
      name : "tensorrt"
      parameters { key: "precision_mode" value: "FP16" }
      parameters { key: "max_workspace_size_bytes" value: "2147483648" }
    }]
  }
}


 

instance_group [
 {
   count: 1
   kind: KIND_GPU
   gpus: [ 0 ]
 }
]